node {
  name: "train/steermodel/inputs"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 59
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "train/steermodel/targets"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "train/steermodel/zeros"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train/steermodel/W"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 59
        }
        dim {
          size: 11
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train/steermodel/W/Assign"
  op: "Assign"
  input: "train/steermodel/W"
  input: "train/steermodel/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/W"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train/steermodel/W/read"
  op: "Identity"
  input: "train/steermodel/W"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/W"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/zeros_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 11
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train/steermodel/b"
  op: "Variable"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "train/steermodel/b/Assign"
  op: "Assign"
  input: "train/steermodel/b"
  input: "train/steermodel/zeros_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "train/steermodel/b/read"
  op: "Identity"
  input: "train/steermodel/b"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/MatMul"
  op: "MatMul"
  input: "train/steermodel/inputs"
  input: "train/steermodel/W/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/add"
  op: "Add"
  input: "train/steermodel/MatMul"
  input: "train/steermodel/b/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/y"
  op: "Softmax"
  input: "train/steermodel/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/Log"
  op: "Log"
  input: "train/steermodel/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/mul"
  op: "Mul"
  input: "train/steermodel/targets"
  input: "train/steermodel/Log"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/Sum"
  op: "Sum"
  input: "train/steermodel/mul"
  input: "train/steermodel/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/Neg"
  op: "Neg"
  input: "train/steermodel/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "train/steermodel/Mean"
  op: "Mean"
  input: "train/steermodel/Neg"
  input: "train/steermodel/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/Shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/Fill"
  op: "Fill"
  input: "train/steermodel/gradients/Shape"
  input: "train/steermodel/gradients/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Reshape"
  op: "Reshape"
  input: "train/steermodel/gradients/Fill"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Shape"
  op: "Shape"
  input: "train/steermodel/Neg"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Tile"
  op: "Tile"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Reshape"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Shape_1"
  op: "Shape"
  input: "train/steermodel/Neg"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Shape_2"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Const"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Prod"
  op: "Prod"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Shape_1"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Const"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Const_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Prod_1"
  op: "Prod"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Shape_2"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Const_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Maximum/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Maximum"
  op: "Maximum"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Prod_1"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/floordiv"
  op: "Div"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Prod"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/Cast"
  op: "Cast"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/floordiv"
  attr {
    key: "DstT"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "SrcT"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Mean_grad/truediv"
  op: "Div"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Tile"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/Cast"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Neg_grad/Neg"
  op: "Neg"
  input: "train/steermodel/gradients/train/steermodel/Mean_grad/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Shape"
  op: "Shape"
  input: "train/steermodel/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Size"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/add"
  op: "Add"
  input: "train/steermodel/Sum/reduction_indices"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Size"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/mod"
  op: "Mod"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/add"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Size"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Shape_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/range/start"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/range/delta"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/range"
  op: "Range"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/range/start"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Size"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/range/delta"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Fill/value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Fill"
  op: "Fill"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Shape_1"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Fill/value"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/DynamicStitch"
  op: "DynamicStitch"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/range"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/mod"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Shape"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Fill"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Maximum/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Maximum"
  op: "Maximum"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/DynamicStitch"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Maximum/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/floordiv"
  op: "Div"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Shape"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Maximum"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Reshape"
  op: "Reshape"
  input: "train/steermodel/gradients/train/steermodel/Neg_grad/Neg"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/DynamicStitch"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Sum_grad/Tile"
  op: "Tile"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Reshape"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/floordiv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/Shape"
  op: "Shape"
  input: "train/steermodel/targets"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/Shape_1"
  op: "Shape"
  input: "train/steermodel/Log"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Shape"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/mul"
  op: "Mul"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Tile"
  input: "train/steermodel/Log"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/Sum"
  op: "Sum"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/mul"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/Reshape"
  op: "Reshape"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Sum"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/mul_1"
  op: "Mul"
  input: "train/steermodel/targets"
  input: "train/steermodel/gradients/train/steermodel/Sum_grad/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/Sum_1"
  op: "Sum"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/mul_1"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/Reshape_1"
  op: "Reshape"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Sum_1"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/steermodel/gradients/train/steermodel/mul_grad/Reshape"
  input: "^train/steermodel/gradients/train/steermodel/mul_grad/Reshape_1"
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Reshape"
  input: "^train/steermodel/gradients/train/steermodel/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/gradients/train/steermodel/mul_grad/Reshape"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/mul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/Reshape_1"
  input: "^train/steermodel/gradients/train/steermodel/mul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/gradients/train/steermodel/mul_grad/Reshape_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Log_grad/Reciprocal"
  op: "Reciprocal"
  input: "train/steermodel/y"
  input: "^train/steermodel/gradients/train/steermodel/mul_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/Log_grad/mul"
  op: "Mul"
  input: "train/steermodel/gradients/train/steermodel/mul_grad/tuple/control_dependency_1"
  input: "train/steermodel/gradients/train/steermodel/Log_grad/Reciprocal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/y_grad/mul"
  op: "Mul"
  input: "train/steermodel/gradients/train/steermodel/Log_grad/mul"
  input: "train/steermodel/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/y_grad/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/y_grad/Sum"
  op: "Sum"
  input: "train/steermodel/gradients/train/steermodel/y_grad/mul"
  input: "train/steermodel/gradients/train/steermodel/y_grad/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/y_grad/Reshape/shape"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\001\000\000\000"
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/y_grad/Reshape"
  op: "Reshape"
  input: "train/steermodel/gradients/train/steermodel/y_grad/Sum"
  input: "train/steermodel/gradients/train/steermodel/y_grad/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/y_grad/sub"
  op: "Sub"
  input: "train/steermodel/gradients/train/steermodel/Log_grad/mul"
  input: "train/steermodel/gradients/train/steermodel/y_grad/Reshape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/y_grad/mul_1"
  op: "Mul"
  input: "train/steermodel/gradients/train/steermodel/y_grad/sub"
  input: "train/steermodel/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/Shape"
  op: "Shape"
  input: "train/steermodel/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/Shape_1"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 11
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/BroadcastGradientArgs"
  op: "BroadcastGradientArgs"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Shape"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/Sum"
  op: "Sum"
  input: "train/steermodel/gradients/train/steermodel/y_grad/mul_1"
  input: "train/steermodel/gradients/train/steermodel/add_grad/BroadcastGradientArgs"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/Reshape"
  op: "Reshape"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Sum"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Shape"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/Sum_1"
  op: "Sum"
  input: "train/steermodel/gradients/train/steermodel/y_grad/mul_1"
  input: "train/steermodel/gradients/train/steermodel/add_grad/BroadcastGradientArgs:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          unknown_rank: true
        }
      }
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/Reshape_1"
  op: "Reshape"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Sum_1"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Shape_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/steermodel/gradients/train/steermodel/add_grad/Reshape"
  input: "^train/steermodel/gradients/train/steermodel/add_grad/Reshape_1"
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Reshape"
  input: "^train/steermodel/gradients/train/steermodel/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/gradients/train/steermodel/add_grad/Reshape"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/add_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/steermodel/gradients/train/steermodel/add_grad/Reshape_1"
  input: "^train/steermodel/gradients/train/steermodel/add_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/gradients/train/steermodel/add_grad/Reshape_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul"
  op: "MatMul"
  input: "train/steermodel/gradients/train/steermodel/add_grad/tuple/control_dependency"
  input: "train/steermodel/W/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 59
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: true
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul_1"
  op: "MatMul"
  input: "train/steermodel/inputs"
  input: "train/steermodel/gradients/train/steermodel/add_grad/tuple/control_dependency"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: true
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/MatMul_grad/tuple/group_deps"
  op: "NoOp"
  input: "^train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul"
  input: "^train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul_1"
}
node {
  name: "train/steermodel/gradients/train/steermodel/MatMul_grad/tuple/control_dependency"
  op: "Identity"
  input: "train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul"
  input: "^train/steermodel/gradients/train/steermodel/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 59
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/gradients/train/steermodel/MatMul_grad/tuple/control_dependency_1"
  op: "Identity"
  input: "train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul_1"
  input: "^train/steermodel/gradients/train/steermodel/MatMul_grad/tuple/group_deps"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/gradients/train/steermodel/MatMul_grad/MatMul_1"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/GradientDescent/learning_rate"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "train/steermodel/GradientDescent/update_train/steermodel/W/ApplyGradientDescent"
  op: "ApplyGradientDescent"
  input: "train/steermodel/W"
  input: "train/steermodel/GradientDescent/learning_rate"
  input: "train/steermodel/gradients/train/steermodel/MatMul_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/W"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 59
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/GradientDescent/update_train/steermodel/b/ApplyGradientDescent"
  op: "ApplyGradientDescent"
  input: "train/steermodel/b"
  input: "train/steermodel/GradientDescent/learning_rate"
  input: "train/steermodel/gradients/train/steermodel/add_grad/tuple/control_dependency_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "train/steermodel/GradientDescent"
  op: "NoOp"
  input: "^train/steermodel/GradientDescent/update_train/steermodel/W/ApplyGradientDescent"
  input: "^train/steermodel/GradientDescent/update_train/steermodel/b/ApplyGradientDescent"
}
node {
  name: "train/steermodel/ArgMax/dimension"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "train/steermodel/ArgMax"
  op: "ArgMax"
  input: "train/steermodel/y"
  input: "train/steermodel/ArgMax/dimension"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
}
node {
  name: "train/steermodel/one_hot/on_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "train/steermodel/one_hot/off_value"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "train/steermodel/one_hot/depth"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 11
      }
    }
  }
}
node {
  name: "train/steermodel/one_hot"
  op: "OneHot"
  input: "train/steermodel/ArgMax"
  input: "train/steermodel/one_hot/depth"
  input: "train/steermodel/one_hot/on_value"
  input: "train/steermodel/one_hot/off_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "TI"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "axis"
    value {
      i: -1
    }
  }
}
node {
  name: "init"
  op: "NoOp"
  input: "^train/steermodel/W/Assign"
  input: "^train/steermodel/b/Assign"
}
node {
  name: "report_uninitialized_variables/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "train/steermodel/W"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/W"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "report_uninitialized_variables/IsVariableInitialized_1"
  op: "IsVariableInitialized"
  input: "train/steermodel/b"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@train/steermodel/b"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
